//包含标准输入输出函数
#include <stdio.h>
//定义main函数
int main()
{
    //请在此添加‘奖金发放’的代码,预期格式如下，可改动。 
    /*****************Begin******************/
         double x,y;
         int a;
         scanf("%lf",&x);
         a=x/100000;
         switch (a){
    	 case 0:
		 	y=x*0.1;
		 	 break;
    	 case 1:	
		 y=100000*0.1+(x-100000)*0.075;
	      break;
    	 case 2:
         case 3:
    		y=100000*0.1+100000*0.075+(x-200000)*0.05;
    	 break;
    	 case 4:
		 case 5:
    		y=100000*0.1+100000*0.075+200000*0.05+(x-400000)*0.03;
		 break;
		 case 6:
		 case 7:
		 case 8:
		 case 9:
			y=100000*0.1+100000*0.075+200000*0.05+200000*0.03+(x-600000)*0.015;
	     break;
		 default: y=100000*0.1+100000*0.075+200000*0.05+200000*0.03+400000*0.015+(x-1000000)*0.01;
         break;
	}
		printf("%.2f",y);
    /***************** End ******************/
    return 0;
}

